### SQL Module From Yandex Praktikum Data Analyst Course

Tasks were solved using **PostgreSQL**

###### SELECT

In [ ]:
# Select columns: id_product, name, category, name_store 
# From: products_data_all
SELECT 
  id_product, 
  name, 
  category, 
  name_store 
FROM 
  products_data_all;

In [ ]:
# Retrieve all columns from products_data_all
SELECT 
  * 
FROM 
  products_data_all;

In [ ]:
# Retrieve all columns from transactions
SELECT 
  * 
FROM 
  transactions;

In [ ]:
# Retrieve all columns from weather
SELECT 
  * 
FROM 
  weather;

###### WHERE

In [ ]:
# Select data having category 'milk & cream' and update date 2019-06-01
SELECT 
  name, 
  price, 
  name_store, 
  date_upd 
FROM 
  products_data_all 
WHERE 
  category = 'milk & cream' 
  AND date_upd = '2019-06-01';

In [ ]:
# Select data having category 'milk & cream' and update date 2019-06-08, 
# 2019-06-15, 2019-06-22, 2019-06-29
SELECT 
  name, 
  price, 
  name_store, 
  date_upd 
FROM 
  products_data_all 
WHERE 
  category = 'milk & cream' 
  AND date_upd IN (
    '2019-06-08', '2019-06-15', '2019-06-22', 
    '2019-06-29'
  );

In [ ]:
# Select data having id_product from a provided list and 
# date 2019-06-01 and 2019-06-02
SELECT 
  * 
FROM 
  transactions 
WHERE 
  date BETWEEN '2019-06-01' 
  AND '2019-06-02' 
  AND id_product IN (
    0, 1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 15, 
    16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 
    26, 28, 29, 30, 31, 32, 34, 35, 36, 37, 
    38, 39, 40, 42, 43, 44, 45, 47, 48, 49, 
    50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 
    60, 61, 63, 64, 65, 66, 67, 68, 69, 70, 
    71, 72, 73, 74, 75, 76, 77, 78, 80, 81, 
    82, 83, 84, 86, 88, 89, 90, 91, 92, 93, 
    95, 96, 97, 98, 99, 100, 102, 103, 104, 
    105, 106, 107, 108, 109, 110, 111, 112, 
    113, 114, 115, 116, 118, 119, 5, 14, 27, 
    33, 41, 46, 62, 79, 85, 87, 94, 101, 117
  );

###### Aggregate Functions

In [ ]:
# Count an overall number of rows of the products_data_all table
SELECT 
  COUNT(*) AS cnt 
FROM 
  products_data_all;

In [ ]:
# Count an overall number of rows, number of values and unque values of
# the name column in the products_data_all table
SELECT 
  COUNT(*) AS cnt, 
  COUNT(name) AS name_cnt, 
  COUNT(DISTINCT name) AS name_uniq_cnt 
FROM 
  products_data_all;

In [ ]:
# Calculate an average price (products_data_all table) 
SELECT 
  AVG(price) AS average 
FROM 
  products_data_all;

In [ ]:
# Calculate an average price of a product 'Мilk 2,5%, 930 ml' 
# in the 'Seventh store'
SELECT 
  AVG(price) AS average 
FROM 
  products_data_all 
WHERE 
  name = 'Мilk 2,5%, 930 ml' 
  AND name_store = 'Seventh store';

In [ ]:
# Calculate the total worth of all products in the 'Milky' store
SELECT 
  SUM(price) AS summa 
FROM 
  products_data_all 
WHERE 
  name_store = 'Milky';

In [ ]:
# Find the max price in the products_data_all table
SELECT 
  MAX(price) AS max_price 
FROM 
  products_data_all;

In [ ]:
# Find the difference between the max and min price of a product
# 'Dairy Butter Ecotavush 99%, 500 g' in the 'TasteMall' store
SELECT 
  MAX(price) - MIN(price) AS max_min_diff 
FROM 
  products_data_all 
WHERE 
  name = 'Dairy Butter Ecotavush 99%, 500 g' 
  AND name_store = 'TasteMall'

###### Data Types CASTing

In [ ]:
# Calculate an average weight for products weighted in grams
SELECT 
  AVG(
    CAST(weight AS real)
  ) AS average 
FROM 
  products_data_all 
WHERE 
  units = 'г';

In [ ]:
# Find the max weight of a product in the category 'milk & cream'
SELECT 
  MAX(
    CAST(weight AS real)
  ) AS max_weight 
FROM 
  products_data_all 
WHERE 
  category = 'milk & cream';

###### GROUP BY

In [ ]:
# Count number of products and unique products in various stores 
# (group the result by store names)
SELECT 
  name_store, 
  COUNT(name) AS name_cnt, 
  COUNT(DISTINCT name) AS name_uniq_cnt 
FROM 
  products_data_all 
GROUP BY 
  name_store;

In [ ]:
# Count the max weight of a product for each products' category
SELECT 
  category, 
  MAX(
    CAST(weight AS real)
  ) 
FROM 
  products_data_all 
GROUP BY 
  category;

In [ ]:
# Calculate max, min and average price for products in each store
SELECT 
  name_store, 
  AVG(price) AS average_price, 
  MAX(price) AS max_price, 
  MIN(price) AS min_price 
FROM 
  products_data_all 
GROUP BY 
  name_store;

In [ ]:
# Find the difference between the max and min price for each product
# in the category 'dairy butter' on the 2019-06-10
SELECT 
  name, 
  MAX(price) - MIN(price) AS max_min_diff 
FROM 
  products_data_all 
WHERE 
  category = 'dairy butter' 
  AND CAST(date_upd AS date) = '2019-06-10' 
GROUP BY 
  name;

###### ORDER BY

In [ ]:
# Find the number of products in each category for the 2019-06-05.
# Sort the result in ascending order.
SELECT 
  CAST(date_upd AS date) AS update_date, 
  category, 
  COUNT(name) AS name_cnt 
FROM 
  products_data_all 
WHERE 
  CAST(date_upd AS date) = '2019-06-05' 
GROUP BY 
  category, 
  update_date 
ORDER BY 
  name_cnt ASC;

In [ ]:
# Count the number of unique products in each category 
# in the 'Lentro' store on the '2019-06-30'.
# Sort the result in descending order
SELECT 
  CAST(date_upd AS date) AS update_date, 
  name_store, 
  category, 
  COUNT(DISTINCT name) AS uniq_name_cnt 
FROM 
  products_data_all 
WHERE 
  name_store = 'Lentro' 
  AND CAST(date_upd AS date) = '2019-06-30' 
GROUP BY 
  update_date, 
  name_store, 
  category 
ORDER BY 
  uniq_name_cnt DESC;

###### LIMIT

In [ ]:
# Find the top-5 most expensive products.
SELECT 
  name, 
  MAX(price) AS max_price 
FROM 
  products_data_all 
GROUP BY 
  name 
ORDER BY 
  max_price DESC 
LIMIT 
  5;

###### HAVING

In [ ]:
# Find the max price of each product. Show the name and the max price
# of the products having the max price > 500.
SELECT 
  name, 
  MAX(price) AS max_price 
FROM 
  products_data_all 
GROUP BY 
  name 
HAVING 
  MAX(price) > 500;

In [ ]:
# Find the amount of products having weight > 900 g for the '2019-06-03'
# Group the result by store name and show only products having the 
# amount < 10.
SELECT 
  CAST(date_upd AS date) AS update_date, 
  name_store, 
  COUNT(name) AS name_cnt 
FROM 
  products_data_all 
WHERE 
  (
    CAST(date_upd AS date) = '2019-06-03' 
    AND units = 'г'
  ) 
  AND CAST(weight AS real) > 900 
GROUP BY 
  name_store, 
  CAST(date_upd AS date) 
HAVING 
  COUNT(name) < 10;

In [ ]:
# Find the amount of unique products for each store. Reveal three
# stores with the least amount of unique goods among stores having more
# than 30 uniqe products.
SELECT 
  name_store, 
  COUNT(DISTINCT name) AS name_uniq_cnt 
FROM 
  products_data_all 
GROUP BY 
  name_store 
HAVING 
  COUNT(DISTINCT name) > 30 
ORDER BY 
  COUNT(DISTINCT name) ASC 
LIMIT 
  3;

###### EXTRACT

In [ ]:
# Extract hours from the date column (transactions table)
SELECT 
  EXTRACT(
    HOUR 
    FROM 
      date
  ) AS hours 
FROM 
  transactions;

In [ ]:
# Extract hours from the date column (transactions table)
# Group the data by hours and count the amount of products being sold.
# Sort the data by hours in ascending order.
SELECT 
  EXTRACT(
    HOUR 
    FROM 
      date
  ) AS hours, 
  COUNT(id_product) AS cnt 
FROM 
  transactions 
GROUP BY 
  hours 
ORDER BY 
  hours;

In [ ]:
# Extract day values from the date column (transactions table)
# Group the data by days and count the amount of products being sold.
# Sort the data by days in ascending order. 
SELECT 
  EXTRACT(
    DAY 
    FROM 
      date
  ) AS days, 
  COUNT(id_product) AS cnt 
FROM 
  transactions 
GROUP BY 
  days 
ORDER BY 
  days ASC;

###### DATE_TRUNC

In [ ]:
# Truncate the date to day. Group the data by days and 
# count the amount of products being sold.
# Sort the data by days in ascending order.  
SELECT 
  DATE_TRUNC('day', date) AS date_month, 
  COUNT(id_product) AS cnt 
FROM 
  transactions 
GROUP BY 
  date_month 
ORDER BY 
  date_month ASC;

###### Subqueries

In [ ]:
# Query product ids from the table products_data_all
# having category 'milk & cream' and the price > 120
# or the category 'dairy butter' and the price > 354
SELECT 
  id_product 
FROM 
  products_data_all 
WHERE 
  (
    category = 'milk & cream' 
    AND price > 120
  ) 
  OR (
    category = 'dairy butter' 
    AND price > 354
  );

In [ ]:
# Find unique user ids who has bought products from the category 'milk & cream' 
# and having the price > 120 or from the category 'dairy butter' 
# and having the price > 354
SELECT 
  DISTINCT(user_id) 
FROM 
  transactions 
WHERE 
  id_product IN (
    SELECT 
      id_product 
    FROM 
      products_data_all 
    WHERE 
      (
        category = 'milk & cream' 
        AND price > 120
      ) 
      OR (
        category = 'dairy butter' 
        AND price > 354
      )
  );

In [ ]:
# Truncate the date to day and count unique transactions
SELECT 
  COUNT(DISTINCT id_transaction) AS transaction_per_day, 
  DATE_TRUNC('day', date) AS trunc_date 
FROM 
  transactions 
GROUP BY 
  trunc_date;

In [ ]:
# Use the previous query as a subquery to extract week numbers
# and calculate an average number of transactions per day.
# Group the result by week numbers.
SELECT 
  EXTRACT(
    WEEK 
    FROM 
      SUBQ.trunc_date
  ) AS week_number, 
  AVG(SUBQ.transaction_per_day) AS avg_week_transaction 
FROM 
  (
    SELECT 
      COUNT(DISTINCT id_transaction) AS transaction_per_day, 
      DATE_TRUNC('day', date) AS trunc_date 
    FROM 
      transactions 
    GROUP BY 
      trunc_date
  ) AS SUBQ 
GROUP BY 
  week_number;

###### CASE WHEN ... THEN ... ELSE ... END

In [ ]:
# Check for NULL values in the column weight table products.
SELECT 
  id_product, 
  units, 
  weight 
FROM 
  products 
WHERE 
  weight IS NULL

In [ ]:
# Find the number of NULL values in the column weight table products.
SELECT 
  COUNT(*) 
FROM 
  products 
WHERE 
  weight IS NULL

In [ ]:
# Find an average weigth of products grouped by units of measurements (column units)
SELECT 
  AVG(
    CAST(weight AS real)
  ) AS avg_weight, 
  units 
FROM 
  products 
GROUP BY 
  units

In [ ]:
# Substitute NULL values with average values calculted on the previous step.
SELECT 
  name, 
  CASE WHEN units = '%' 
  AND weight IS NULL THEN '72' WHEN units = 'kg' 
  AND weight IS NULL THEN '1' WHEN units = 'l' 
  AND weight IS NULL THEN '1' WHEN units = 'ml' 
  AND weight IS NULL THEN '805' WHEN units = 'g' 
  AND weight IS NULL THEN '402' ELSE weight END AS weight_info 
FROM 
  products

###### LIKE

In [ ]:
# Find a row with '%' in units column
SELECT 
  * 
FROM 
  products 
WHERE 
  units LIKE '!%' ESCAPE '!';

In [ ]:
# Find products names having 'My' and 'My-My' in their names.
SELECT 
  * 
FROM 
  products 
WHERE 
  name LIKE '%Му%';

In [ ]:
# Calculate an average price of the products in category 'milk & cream' 
# sold on the 2019-06-01 and having 'My' and 'My-My' in their names.
SELECT 
  AVG(price) AS avg_price 
FROM 
  products_stores 
WHERE 
  date_upd = '2019-06-01' 
  AND id_product IN (
    SELECT 
      id_product 
    FROM 
      products 
    WHERE 
      name LIKE '%Му%' 
      AND category = 'milk & cream'
  );

###### JOINS

In [ ]:
# Inner join two tables on id_product field. Order the result by id_transaction (ascending)
# and limit the output to 10 items.
SELECT 
  id_transaction, 
  category, 
  name 
FROM 
  transactions 
  INNER JOIN products ON products.id_product = transactions.id_product 
ORDER BY 
  id_transaction ASC 
LIMIT 
  10

In [ ]:
# Show temperature and rain values from the weather table for transactions stored 
# in the transactions column. Sort the result by the date of transaction 
# in descending order.
SELECT 
  DISTINCT transactions.date AS date, 
  weather.temp AS temp, 
  weather.rain AS rain, 
  transactions.id_transaction 
FROM 
  transactions 
  INNER JOIN weather ON CAST(weather.date AS date) = CAST(transactions.date AS date) 
ORDER BY 
  date DESC;

In [ ]:
# Select unique products having price > 300 
SELECT 
  DISTINCT products.name AS name 
FROM 
  products 
  INNER JOIN products_stores ON products_stores.id_product = products.id_product 
WHERE 
  products_stores.price > 300;

In [ ]:
# Select transactions in category 'dairy butter' made on the 2019-06-20. 
SELECT 
  transactions.date AS date, 
  transactions.id_transaction AS id_transaction, 
  products.category AS category, 
  products.name AS name 
FROM 
  transactions 
  INNER JOIN products ON products.id_product = transactions.id_product 
WHERE 
  products.category = 'dairy butter' 
  AND CAST(transactions.date AS date) = '2019-06-20'

In [ ]:
# Find the price of products sold on 2019-06-13 having unit of measurments 'ml'
SELECT 
  products.name AS name, 
  products.category AS category, 
  products.units AS units, 
  products.weight AS weight, 
  products_stores.price AS price 
FROM 
  products 
  INNER JOIN products_stores ON products_stores.id_product = products.id_product 
WHERE 
  products.units = 'мл' 
  AND CAST(products_stores.date_upd AS date) = '2019-06-13'

In [ ]:
# Select unique id_products and name from the products table and id_store from
# the products_store table using left join.
SELECT 
  DISTINCT products.id_product AS id_product, 
  products.name AS name, 
  products_stores.id_store AS id_store 
FROM 
  products 
  LEFT JOIN products_stores ON products_stores.id_product = products.id_product

In [ ]:
# Show unique products names that haven't been sold in the store that has 
# id_store equal to 3. Use left join to solve the task.
SELECT 
  DISTINCT products.name AS name 
FROM 
  products 
  LEFT JOIN (
    SELECT 
      DISTINCT id_product 
    FROM 
      transactions 
    WHERE 
      id_store = '3'
  ) AS subquery ON subquery.id_product = products.id_product 
WHERE 
  subquery.id_product IS NULL

In [ ]:
# Show unique products names that haven't been sold in none of the stores
# on 2019-06-11
SELECT 
  DISTINCT products.name AS name 
FROM 
  products 
  LEFT JOIN (
    SELECT 
      DISTINCT id_product, 
      id_store 
    FROM 
      transactions 
    WHERE 
      CAST(transactions.date AS date) = '2019-06-11'
  ) AS subquery ON subquery.id_product = products.id_product 
WHERE 
  subquery.id_product IS NULL

In [ ]:
# Retrieve dates when we have weather data but do not have any transactions data. Use
# right join.
SELECT 
  CAST(weather.date AS date) AS date 
FROM 
  transactions 
  RIGHT JOIN weather ON CAST(weather.date AS date) = CAST(transactions.date AS date) 
WHERE 
  transactions.date IS NULL

In [ ]:
# Show unique products names that haven't been sold in the store that has 
# id_store equal to 3. Use right join to solve the task.
SELECT 
  DISTINCT products.name AS name 
FROM 
  (
    SELECT 
      DISTINCT id_product 
    FROM 
      transactions 
    WHERE 
      id_store = '3'
  ) AS subquery 
  RIGHT JOIN products ON products.id_product = subquery.id_product 
WHERE 
  subquery.id_product IS NULL

In [ ]:
# Retrieve id_transaction, name_store, category and products' name for all
# the transactions made on the 2019-06-05
SELECT 
  transactions.id_transaction AS id_transaction, 
  stores.name_store AS name_store, 
  products.category AS category, 
  products.name AS name 
FROM 
  transactions 
  INNER JOIN products ON products.id_product = transactions.id_product 
  INNER JOIN stores ON stores.id_store = transactions.id_store 
WHERE 
  CAST(transactions.date AS date) = '2019-06-05'

In [ ]:
# Find the info about the weather and sold products.
# Sort the output by date (descending) and name (ascending) 
# and limit the outup to 30 rows.
SELECT 
  CAST(weather.date AS date) AS date, 
  weather.temp AS temp, 
  weather.rain AS rain, 
  products.name AS name 
FROM 
  weather 
  LEFT JOIN transactions ON CAST(transactions.date AS date) = CAST(weather.date AS date) 
  LEFT JOIN products ON transactions.id_product = products.id_product 
ORDER BY 
  date DESC, 
  name ASC 
LIMIT 
  30

In [ ]:
# Show id_transaction and products' name for items sold on days when there were no rain.
SELECT 
  transactions.id_transaction AS id_transaction, 
  products.name AS name 
FROM 
  transactions 
  INNER JOIN products ON products.id_product = transactions.id_product 
  INNER JOIN weather ON CAST(weather.date AS date) = CAST(transactions.date AS date) 
WHERE 
  weather.rain = '0'

In [ ]:
# Count the number of products an the number of unique products for each transaction.
# Limit the output to 10 rows.
SELECT 
  transactions.id_transaction AS id_transaction, 
  COUNT(products.name) AS name_cnt, 
  COUNT(DISTINCT products.name) AS name_uniq_cnt 
FROM 
  transactions 
  INNER JOIN products ON transactions.id_product = products.id_product 
GROUP BY 
  transactions.id_transaction 
LIMIT 
  10

In [ ]:
# Find transactions having non-unique products sold.
SELECT 
  transactions.id_transaction AS id_transaction, 
  COUNT(products.name) AS name_cnt, 
  COUNT(DISTINCT products.name) AS name_uniq_cnt 
FROM 
  transactions 
  INNER JOIN products ON products.id_product = transactions.id_product 
GROUP BY 
  id_transaction 
HAVING 
  COUNT(products.name) != COUNT(DISTINCT products.name)

In [ ]:
# Count the number of transaction made on sunny and on rainy days.
# Group the output by the column rain (weather table).
SELECT 
  weather.rain AS rain, 
  COUNT(
    DISTINCT transactions.id_transaction
  ) AS id_transaction 
FROM 
  transactions 
  INNER JOIN weather ON CAST(weather.date AS date) = CAST(transactions.date AS date) 
GROUP BY 
  weather.rain

In [ ]:
# Retrieve the temperature and the number of transactions.
# Group the output by date and temperature.
# Sort the values by date in the ascending order.
SELECT 
  CAST(weather.date AS date) AS date, 
  weather.temp AS temp, 
  COUNT(
    DISTINCT transactions.id_transaction
  ) AS uniq_transactions 
FROM 
  weather 
  LEFT JOIN transactions ON CAST(transactions.date AS date) = CAST(weather.date AS date) 
GROUP BY 
  CAST(weather.date AS date), 
  weather.temp 
ORDER BY 
  CAST(weather.date AS date) ASC

In [ ]:
# Calculate the number of items and the total price for every transaction.
# Reveal only transactions having the total price > 1000.
SELECT 
  transactions.id_transaction AS id_transaction, 
  SUM(products_stores.price) AS total, 
  COUNT(products_stores.id_product) AS amount 
FROM 
  transactions 
  LEFT JOIN products_stores ON CAST(products_stores.date_upd AS date) = CAST(transactions.date AS date) 
  AND products_stores.id_product = transactions.id_product 
  AND products_stores.id_store = transactions.id_store 
GROUP BY 
  transactions.id_transaction 
HAVING 
  SUM(products_stores.price) > 1000

###### UNION

In [ ]:
# SELECT unique products' name for transactions made on 2019-06-01.
SELECT 
  DISTINCT products.name AS name 
FROM 
  products 
  LEFT JOIN (
    SELECT 
      transactions.id_product 
    FROM 
      transactions 
    WHERE 
      CAST(transactions.date AS date) = '2019-06-01'
  ) AS subq ON products.id_product = subq.id_product 
WHERE 
  subq.id_product IS NOT NULL;

In [ ]:
# SELECT unique products' name for transactions made on 2019-06-08.
SELECT 
  DISTINCT products.name AS name 
FROM 
  products 
  LEFT JOIN (
    SELECT 
      transactions.id_product 
    FROM 
      transactions 
    WHERE 
      CAST(transactions.date AS date) = '2019-06-08'
  ) AS subq ON products.id_product = subq.id_product 
WHERE 
  subq.id_product IS NOT NULL;

In [ ]:
# Merge two queries (from the previous steps) together.
# Remove duplicates.
SELECT 
  DISTINCT products.name AS name 
FROM 
  products 
  LEFT JOIN (
    SELECT 
      id_product 
    FROM 
      transactions 
    WHERE 
      CAST(transactions.date AS date) = '2019-06-01'
  ) AS SUBQ1 ON products.id_product = SUBQ1.id_product 
WHERE 
  SUBQ1.id_product IS NOT NULL 
UNION 
SELECT 
  DISTINCT products.name AS name 
FROM 
  products 
  LEFT JOIN (
    SELECT 
      id_product 
    FROM 
      transactions 
    WHERE 
      CAST(transactions.date AS date) = '2019-06-08'
  ) AS SUBQ2 ON products.id_product = SUBQ2.id_product 
WHERE 
  SUBQ2.id_product IS NOT NULL;

In [ ]:
# Count the number of products using the previous query as a sub-query.
SELECT 
  COUNT(SUBQ.name) 
FROM 
  (
    SELECT 
      DISTINCT products.name AS name 
    FROM 
      products 
      LEFT JOIN (
        SELECT 
          id_product 
        FROM 
          transactions 
        WHERE 
          CAST(transactions.date AS date) = '2019-06-01'
      ) AS SUBQ1 ON products.id_product = SUBQ1.id_product 
    WHERE 
      SUBQ1.id_product IS NOT NULL 
    UNION 
    SELECT 
      DISTINCT products.name AS name 
    FROM 
      products 
      LEFT JOIN (
        SELECT 
          id_product 
        FROM 
          transactions 
        WHERE 
          CAST(transactions.date AS date) = '2019-06-08'
      ) AS SUBQ2 ON products.id_product = SUBQ2.id_product 
    WHERE 
      SUBQ2.id_product IS NOT NULL
  ) AS SUBQ

In [ ]:
# Merge two queries (from the previous steps) together without removing duplicates.
# Count the number of products using the merged queries as a sub-query.
SELECT 
  COUNT(SUBQ.name) 
FROM 
  (
    SELECT 
      DISTINCT products.name AS name 
    FROM 
      products 
      LEFT JOIN (
        SELECT 
          id_product 
        FROM 
          transactions 
        WHERE 
          CAST(transactions.date AS date) = '2019-06-01'
      ) AS SUBQ1 ON products.id_product = SUBQ1.id_product 
    WHERE 
      SUBQ1.id_product IS NOT NULL 
    UNION ALL 
    SELECT 
      DISTINCT products.name AS name 
    FROM 
      products 
      LEFT JOIN (
        SELECT 
          id_product 
        FROM 
          transactions 
        WHERE 
          CAST(transactions.date AS date) = '2019-06-08'
      ) AS SUBQ2 ON products.id_product = SUBQ2.id_product 
    WHERE 
      SUBQ2.id_product IS NOT NULL
  ) AS SUBQ;